# GetSaveModifiedLinksOptionForUnloadLocally Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ISaveSharedCoordinatesCallbackForUnloadLocally..::..GetSaveModifiedLinksOptionForUnloadLocally Method
ISaveSharedCoordinatesCallbackForUnloadLocally Interface See Also
---
Determines whether Revit should save the link or not prior to unloading the link locally.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
SaveModifiedLinksOptionsForUnloadLocally GetSaveModifiedLinksOptionForUnloadLocally(
	RevitLinkType link
)
```

Visual Basic
---
```text
Function GetSaveModifiedLinksOptionForUnloadLocally ( _
	link As RevitLinkType _
) As SaveModifiedLinksOptionsForUnloadLocally
```

Visual C++
---
```text
SaveModifiedLinksOptionsForUnloadLocally GetSaveModifiedLinksOptionForUnloadLocally(
	RevitLinkType^ link
)
```

# ### Parameters
link
    Type: Autodesk.Revit.DB..::..RevitLinkType The Revit link which has modified shared coordinates.
# ### Return Value
The saving option when unloading locally a linked file which has been modified in-memory by shared coordinates operations.
# See Also
ISaveSharedCoordinatesCallbackForUnloadLocally Interface
Autodesk.Revit.DB Namespace